
* Development

#+begin_src haskell :results output
:r
:set prompt "> "
:set -Wno-type-defaults
:set -Wno-name-shadowing
:set -XOverloadedStrings
:set -XRebindableSyntax
:set -XQuasiQuotes
import Prelude qualified
import NumHask.Prelude hiding ((.))
import NumHask.Prelude qualified as P
import NumHask.Array.Dynamic qualified as D
import NumHask.Array.Shape qualified as Shape
import Huihua.Array
import Huihua.Array qualified as A
import Huihua.Stack
import Huihua.Stack qualified as S
import Huihua.Parse
import Huihua.Parse.FlatParse
import Data.ByteString.Char8 qualified as C
import Data.String.Interpolate
import Data.ByteString (ByteString)
#+end_src

#+RESULTS:
: Ok, four modules loaded.

#+begin_src haskell :results output
runParser tokens "[@u @i @u @a]"
#+end_src

#+RESULTS:
: OK [GlyphToken ArrayLeft,CharacterToken 'u',CharacterToken 'i',CharacterToken 'u',CharacterToken 'a',GlyphToken ArrayRight] ""

#+begin_src haskell :results output
runParser tokens [i|△."Hello, World!"|]
#+end_src

#+RESULTS:
: OK [GlyphToken Shape,GlyphToken Duplicate,StringToken "Hello, World!"] ""

#+begin_src haskell :results output
runParser tokens [i|⊂ 1_2 3|]
#+end_src

#+RESULTS:
: OK [GlyphToken Join,DoubleToken 1.0,GlyphToken Strand,DoubleToken 2.0,DoubleToken 3.0] ""


#+begin_src haskell :results output
P.length <$> C.unpack <$> allTheSymbols
#+end_src

#+RESULTS:
: [1,1,3,1,3,2,2,2,3,3,3,3,3,3,1,3,4,3,4,3,1,1,2,2,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,1,3,1,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,1,1,3,3,1,3,3,3,2,2,2,3,1,1,1,1,1,1,1,1,2,1,1,1,3,1,1]

* ToDo negative bug

This character doesn't parse properly in a *.hs file.
"¯"

#+begin_src haskell :results output
:t Negative
#+end_src

#+RESULTS:
: Negative :: Glyph

* Creating the glyph list

#+begin_src haskell :results output
traverse_ C.putStrLn (zipWith (\s g -> [i| "#{s}" -> pure #{g}|]) allTheSymbols allTheGlyphs :: [ByteString])

#+end_src

#+begin_src haskell :results output
traverse_ C.putStrLn ts
#+end_src

#+RESULTS:
#+begin_example
.
,
∶
;
∘
¬
±
¯
⌵
√
○
⌊
⌈
⁅
=
≠
&lt;
≤
&gt;
≥
+
-
×
÷
◿
ⁿ
ₙ
↧
↥
∠
⧻
△
⇡
⊢
⇌
♭
⋯
⍉
⍏
⍖
⊚
⊛
⊝
□
⊔
≅
⊟
⊂
⊏
⊡
↯
↙
↘
↻
◫
▽
⌕
∊
⊗
/
∧
\
∵
≡
∺
⊞
⊠
⍥
⊕
⊜
⍘
⋅
⊙
∩
⊃
⊓
⍜
⍚
⬚
'
?
⍣
⍤
!
⎋
↬
⚂
η
π
τ
∞
~
_
[]
{}
()
¯
@
$
"
←
|
#
#+end_example

